LabGuide400.md

<img class="float-right" src="https://oracle.github.io/learning-library/workshops/common-content/images/touch-the-cloud/ttc-logo.png" width="200">
# Lab 400 - HCM Integration

## Introduction

This is the forth of several labs that are part of the **ICS Development** workshop. 

In this lab, you will test the integration that was created in Lab 300 and see how the Integration is replicated into HCM Cloud.

## Part 1: Activating the ICS Integration

Before we start testing the integration, you need to activate the integration for testing.

**1.1** Go to Integration "ICSHCM Add Talent Profile UserXX" created in lab 300. On the right side of the integration click on the switch button to activate the integration.

![](images/400/image100.png)

**1.2** Make sure to tick "enable tracing" and "include payload" when the window pops up. Click on the activate button to activate it.

![](images/400/image101.png)

**1.3** When the integration is activated the switch turns to green. A green tab with success messge and url endpoint pops up on top. You can close it by clicking on 'X' button.

![](images/400/image102.png)

**1.4** Next to green switch click on 'i' icon which gives the details about the integration. Make a note of the url endpoint which will be used for testing the integration.

![](images/400/image103.png)

---

### **1.2**: Test Using SoapUI

**1.2.1** Open SoapUI.  If you don't already have this installed, follow the instructions provided in the **Prerequisites** section of this workshop.

![](images/400/image052.png)

**1.2.2** Click on the **SOAP** button so we can create a new project for testing our new ICS SOAP Web Service

![](images/400/image089.png)

**1.2.3** In the **New SOAP Project** dialog window, paste the Endpoint URL from the integration information we noted in the previous section into the **Initial WSDL** window and give a meaningful **Project Name** such as _User03 ICSHCM Add Talent Profile_.  Keep the checkbox selected for **create sample requests for all operations?**.  Click on the **OK** button after you've initialized the settings for your new SoapUI SOAP project.

![](images/400/image104.png)

**1.2.4** The new SOAP Project will appear in the left-hand navigation.

**1.2.5** Expand the **addTalentProfileData** operation by clicking on it, then open the auto-generated sample request **Request 1** by double-clicking on it.  An empty request payload will be generated.

![](images/400/image105.png)

**1.2.6** Remove the request that was autogenerated.

![](images/400/image106.png)

**1.2.7** We will be using one of the below 3 sample requests for testing each having different content item.

Copy paste one of the below request in the 'Request 1 section'.


**1. Request  payload for Athlete:**


	<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tal="http://icshcmpoc.oracle.com/TalentProfileData">
	<soapenv:Header>

	</soapenv:Header>
	<soapenv:Body>
	<tal:TalentProfileData>
	<tal:TalentProfile>
	<tal:PersonNumber>98</tal:PersonNumber>
	<tal:ProfileTypeCode>PERSON</tal:ProfileTypeCode>
	<tal:ProfileCode>PERS_300000047881516</tal:ProfileCode>
	<tal:ProfileStatusCode>A</tal:ProfileStatusCode>
	<tal:ProfileUsageCode>P</tal:ProfileUsageCode>
	</tal:TalentProfile>
	<!--1 or more repetitions:-->
	<tal:ProfileItem>
	<tal:SourceSystemOwner>ICS_HCM_GSE</tal:SourceSystemOwner>

	<tal:SourceSystemId>ADDITIONAL_QUALIFICATIONS_98_ATHELETE</tal:SourceSystemId>
	<!--Make sure that SourceSystemId is always unique-->
	<tal:ProfileCode>PERS_300000047881516</tal:ProfileCode>
	<tal:ContentType>ADDITIONAL_QUALIFICATIONS</tal:ContentType>

	<!--Can use inputs like Artist or Photographer (OOTB created) -->

	<tal:ContentItem>Athlete</tal:ContentItem>
	<tal:DateFrom>2017/05/31</tal:DateFrom>

	<!--Enter description of your choice-->

	<tal:ItemText24010>I'm an athlete </tal:ItemText24010>
	</tal:ProfileItem>
	</tal:TalentProfileData>
	</soapenv:Body>
	</soapenv:Envelope>

**2. Request  payload for Artist:**


	<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tal="http://icshcmpoc.oracle.com/TalentProfileData">
	<soapenv:Header>

	</soapenv:Header>
	<soapenv:Body>
	<tal:TalentProfileData>
	<tal:TalentProfile>
	<tal:PersonNumber>98</tal:PersonNumber>
	<tal:ProfileTypeCode>PERSON</tal:ProfileTypeCode>
	<tal:ProfileCode>PERS_300000047881516</tal:ProfileCode>
	<tal:ProfileStatusCode>A</tal:ProfileStatusCode>
	<tal:ProfileUsageCode>P</tal:ProfileUsageCode>
	</tal:TalentProfile>
	<!--1 or more repetitions:-->
	<tal:ProfileItem>
	<tal:SourceSystemOwner>ICS_HCM_GSE</tal:SourceSystemOwner>

	<tal:SourceSystemId>ADDITIONAL_QUALIFICATIONS_98_ARTIST</tal:SourceSystemId>
	<!--Make sure that SourceSystemId is always unique-->
	<tal:ProfileCode>PERS_300000047881516</tal:ProfileCode>
	<tal:ContentType>ADDITIONAL_QUALIFICATIONS</tal:ContentType>

	<!--Can use inputs like Artist or Photographer (OOTB created) -->

	<tal:ContentItem>Artist</tal:ContentItem>
	<tal:DateFrom>2017/05/31</tal:DateFrom>

	<!--Enter description of your choice-->

	<tal:ItemText24010>I'm a painter </tal:ItemText24010>
	</tal:ProfileItem>
	</tal:TalentProfileData>
	</soapenv:Body>
	</soapenv:Envelope>





**3. Request  payload for Photographer:**


	<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tal="http://icshcmpoc.oracle.com/TalentProfileData">
	<soapenv:Header>

	</soapenv:Header>
	<soapenv:Body>
	<tal:TalentProfileData>
	<tal:TalentProfile>
	<tal:PersonNumber>98</tal:PersonNumber>
	<tal:ProfileTypeCode>PERSON</tal:ProfileTypeCode>
	<tal:ProfileCode>PERS_300000047881516</tal:ProfileCode>
	<tal:ProfileStatusCode>A</tal:ProfileStatusCode>
	<tal:ProfileUsageCode>P</tal:ProfileUsageCode>
	</tal:TalentProfile>
	<!--1 or more repetitions:-->
	<tal:ProfileItem>
	<tal:SourceSystemOwner>ICS_HCM_GSE</tal:SourceSystemOwner>

	<tal:SourceSystemId>ADDITIONAL_QUALIFICATIONS_98_PHOTOGRAPHER</tal:SourceSystemId>
	<!--Make sure that SourceSystemId is always unique-->
	<tal:ProfileCode>PERS_300000047881516</tal:ProfileCode>
	<tal:ContentType>ADDITIONAL_QUALIFICATIONS</tal:ContentType>

	<!--Can use inputs like Artist or Photographer (OOTB created) -->

	<tal:ContentItem>Photographer</tal:ContentItem>
	<tal:DateFrom>2017/05/31</tal:DateFrom>

	<!--Enter description of your choice-->

	<tal:ItemText24010>I'm a wild life photographer </tal:ItemText24010>
	</tal:ProfileItem>
	</tal:TalentProfileData>
	</soapenv:Body>
	</soapenv:Envelope>

---

![](images/400/image107.png)

**3.7** Next we need to add the authorization credentials so ICS will allow the request from SoapUI.  ICS uses basic username/password authentication.

**3.8** Click on the **Auth** button in the lower-left of the **Request 1** SoapUI window

**3.9** In the **Authorization** dropdown, select _Add New Authorization..._

![](images/300/image093.png)

**3.10** In the **Add Authorization** dialog pop-up window, select **Type** of _Basic_ form the picklist, then select the **OK** button.

![](images/300/image094.png)

**3.11** Fill in your assigned username and password in the **Auth (Basic)** window at the bottom of the SoapUI request window

![](images/300/image095.png)

**3.12** ICS needs two headers in the request payload to satisfy the enforced Web Services Security (WSS) standards.  It needs both the **WSS Username Token** and the **WS-Timestamp**.

**3.13** Insert the **WSS Username Token** by right-clicking in the Request payload body and select **Add WSS Username Token** from the pull-down list

![](images/300/image096.png)

**3.14** In the **Specify Password Type** dialog pop-up window, select _PasswordText_ as the WSS Username Token type, then click on the **OK** button.

![](images/300/image097.png)

**3.15** Insert the **WS-Timestamp** by right-clicking in the Request payload body and select **Add WS-Timestamp** from the pull-down list

![](images/300/image098.png)

**3.16** In the **Specify Time-To-Live value** dialog pop-up window, set the value (in milliseconds) to _60000_ (60 seconds), then click on the **OK** button.

![](images/300/image099.png)

**3.17** Finally your request payload is ready to send to ICS.

**3.18** Click on the green _Submit Request_ arrow in the upper left of the **Request 1** window.

![](images/300/image100.png)

**3.19** The right side of the **Request 1** SoapUI window will display the results of the ICS integration call.

**3.20** The return payload of the ICS integration will show the Order Number and the status of `S` for _Success_.

![](images/400/image078.png)

### **3.2:**	Verify the Order was Created in EBS

---

**3.2.1** Login to EBS using the endpoint and credentials provided to you by the workshop organizer.  You will use the user *operations*.

- *NOTE:* For the EBS instance used in this workshop, the Oracle Single Sign-On system is used to regulate access.  Unless individual users are explicitly added to have access to the EBS system, they will not be able to access the following EBS login page.  If you can't access the login page with your Oracle SSO login, then you can look at the following screenshots to see how you would be able to see your Order in an EBS R12.2 system.

![](images/400/image79.png)

**3.2.2** Select the EBS Responsibility *Order Management, HTML User Interface*:

![](images/400/image80.png)

**3.2.3** Examine the list in the *Open Orders* report and verify that your new order shows up in the list.

Note that the _Order Amount_ shown is larger than that of the quote because of shipping costs and taxes that were added automatically by EBS .

![](images/400/image81.png)

You have now completed the final lab of the ICS Developer Workshop.  

Congratulations! You should now have a much better understanding of how to work with ICS to create complex integrations.
